InformationRegisters/РСК_СообщенияСМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>РСК_СообщенияСМС</Name>
			<Comment>РС Консалт, Трофимов Евгений №19208, 25.07.2022 г.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстСМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>600</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDSms</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РСК_КодыСтатусовОтправкиСМС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Баланс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РСК_СообщенияСМС/Forms/ФормаОтправкиСМССообщения/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтправитьСМС(Команда)
	ПараметрыВозврата = Новый Структура();
	ОтправитьСМССервер(ПараметрыВозврата);
	Если ПараметрыВозврата.Свойство("Ошибка") Тогда
		Сообщить(ПараметрыВозврата.Ошибка);
	Иначе
		Сообщить("СМС успешно отправлено");
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ОтправитьСМССервер(ПараметрыВозврата)
	ОтправительСМС = "&from="+Отправитель;
	//Отправка СМС в сервис SMS.ru
	Если Получатель = Справочники.ПолучателиТСР.ПустаяСсылка() Тогда
		ПараметрыВозврата.Вставить("Ошибка","Необходимо выбрать получателя СМС!");
		Возврат ;
		
	КонецЕсли;
	Если ТелефонПолучателя = "" Тогда
		ПараметрыВозврата.Вставить("Ошибка","Необходимо ввести телефон получателя!");
		Возврат ;
		
	КонецЕсли;
	Если ТекстСообщения = "" Тогда
		ПараметрыВозврата.Вставить("Ошибка","Необходимо написать сообщение!");
		Возврат ;
	КонецЕсли;
	
	Попытка
		ВремФайл 			 = ПолучитьИмяВременногоФайла("txt");
		HTTPСоединение = Новый HTTPСоединение("sms.ru",443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		HTTPЗапрос 	   = Новый HTTPЗапрос;
		HTTPЗапрос.АдресРесурса = "sms.ru/sms/send?api_id="+"E9228970-663C-3BCE-99AD-90AF2E37A6BF"+
		"&to="+ТелефонПолучателя+ОтправительСМС+"&msg="+ТекстСообщения+"&json=1";	
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);    
		ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		IDSms =  Сред(СтрПолучитьСтроку(ТекстОтвета, 8) ,24,14);
		Отправлено = ?(HTTPОтвет.КодСостояния = 200, Истина, Ложь);  
	Исключение
		Отправлено = Ложь;
	КонецПопытки;
	
	//Запись результата отправки СМС в регистр
	МенеджерЗаписи = РегистрыСведений.РСК_СообщенияСМС.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Получатель    = Получатель; 
	МенеджерЗаписи.НомерТелефона = ТелефонПолучателя;
	МенеджерЗаписи.Отправлено    = Отправлено;
	МенеджерЗаписи.IDSms         = IDSms;
	МенеджерЗаписи.ТекстСМС      = ТекстСообщения;
	МенеджерЗаписи.Период        = ТекущаяДата();
	МенеджерЗаписи.Записать();
	
	//Возврат параметров отправки СМС
	ПараметрыВозврата.Вставить("Получатель",Получатель);
	ПараметрыВозврата.Вставить("НомерТелефона",ТелефонПолучателя);
	ПараметрыВозврата.Вставить("ТестСообщения",ТекстСообщения);
	ПараметрыВозврата.Вставить("СостояниеОтправления",Отправлено);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПолучательСМС") Тогда
		Получатель = Параметры.ПолучательСМС;
		//ТелефонПолучателя = ПолучитьНомерПолучателя(Получатель);
	КонецЕсли;
	Если Параметры.Свойство("Отправитель") Тогда
		Отправитель = Параметры.Отправитель;
		Если Отправитель ="ORTONICA.RU" Тогда
			ТелефонПолучателя = ПолучитьТелефонКлиентаИзКонтактнойИнформации();
		КонецЕсли
	КонецЕсли;
	Если Параметры.Свойство("ДокументОснование") Тогда
		ДокументОснование = Параметры.ДокументОснование;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КолВоСМС = 0;
	КолВоСимволов = СтрДлина(ТекстСообщения);
	Элементы.НадписьИнформацияОТексте.Заголовок = Строка(КолВоСМС)+" SMS ,"+Строка(КолВоСимволов)+" символов.";	
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСообщенияПриИзменении(Элемент)
	УдалитьЛишниеПробелы();	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПолучателяПриИзменении(Элемент)
	Если СтрДлина(ТелефонПолучателя) = 10 Тогда
		ТелефонПолучателя = "7"+ТелефонПолучателя;
	КонецЕсли; 
	
	Если Лев(ТелефонПолучателя,1) = "8" Тогда
		ТелефонПолучателя = "7"+Сред(ТелефонПолучателя,2);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонСообщенияПриИзменении(Элемент)
//ТекстСообщения = УстановитьТекстСМС();
ТекстСообщения = ПолучитьТекстСообщения();
УдалитьЛишниеПробелы();
КонецПроцедуры
&НаСервере
Функция ПолучитьТекстСообщения()
	НаименованиеСМС = ШаблонСообщения.Наименование;
	Объект = ДокументОснование;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныСообщений.ТекстШаблонаSMS КАК Текст
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	ШаблоныСообщений.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеСМС);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() <> 0 Тогда 
		ТекстСМС = РезультатЗапроса[0].Текст;
		Если НаименованиеСМС = "ИМ ОРТОНИКА - СМС О ПРИНЯТИИ ЗАКАЗА" Тогда
			ТекстСМС = СтрЗаменить(ТекстСМС,"<СуммаЗаказа>",Формат(Объект.СуммаДокумента,"ЧДЦ=2")); 
			ТекстСМС = СтрЗаменить(ТекстСМС,"<НомерЗаказаИз1С>",ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Объект.Номер));
			ТекстСМС = СтрЗаменить(ТекстСМС,"<ИмяМенеджера>",Объект.Менеджер.Наименование);
		ИначеЕсли НаименованиеСМС ="ИМ ОРТОНИКА - СМС С КОДОМ ГРУЗА В ПЭК" Тогда
			ТекстСМС = СтрЗаменить(ТекстСМС,"<КодГрузаИзЗаказаВ1С>",Объект.реа_ИдентификационныйКодОтправки);
		ИначеЕсли НаименованиеСМС ="ИМ ОРТОНИКА - СМС С КОДОМ ГРУЗА В ДЕЛОВЫХ ЛИНИЯХ" Тогда
			ТекстСМС = СтрЗаменить(ТекстСМС,"<КодГрузаИзЗаказаВ1С>",Объект.реа_ИдентификационныйКодОтправки);
		КонецЕсли;
	Иначе
		ТекстСМС = "";
	КонецЕсли;
	
	Возврат ТекстСМС;

КонецФункции

&НаСервере
Функция УстановитьТекстСМС ()
	Возврат ШаблонСообщения.ТекстШаблонаSMS;	
КонецФункции

Функция ПолучитьТелефонКлиентаИзКонтактнойИнформации()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Представление КАК ТелефонКонтрагента
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Владелец
	|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)";
	
	Запрос.УстановитьПараметр("Владелец",Получатель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НомерТелефонаДляОтправки = ВыборкаДетальныеЗаписи.ТелефонКонтрагента;
	КонецЦикла;
	
	СтандартизованныйНомер="";
	Для п=1 По СтрДлина(НомерТелефонаДляОтправки) Цикл
		Симв=Сред(НомерТелефонаДляОтправки,п,1);
		Если Симв>="0" И Симв<="9" Тогда
			СтандартизованныйНомер=СтандартизованныйНомер+Симв;
		КонецЕсли;
	КонецЦикла;
	Если Лев(СтандартизованныйНомер,1) = "8" Тогда
		СтандартизованныйНомер = "7"+Сред(СтандартизованныйНомер,2);
	КонецЕсли;
	
	Возврат СтандартизованныйНомер
КонецФункции

&НаКлиенте
Процедура УдалитьЛишниеПробелы()
	КолВоСимволов = СтрДлина(ТекстСообщения);
	Если КолВоСимволов > 1 Тогда 
		КолВоСМС = 1;
	КонецЕсли;
	Элементы.НадписьИнформацияОТексте.Заголовок = Строка(КолВоСМС)+" SMS ,"+Строка(КолВоСимволов)+" символов.";
	
	ТекстСообщения = УдалитьСимволыПереноса(ТекстСообщения);
	Пока Найти(ТекстСообщения, "  ") > 0 Цикл
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "  ", " ");
	КонецЦикла;
	
	ТекстСообщения = СокрЛП(ТекстСообщения);
	
КонецПроцедуры
&НаКлиенте
Функция УдалитьСимволыПереноса (Строка)
	Количество = СтрЧислоСтрок(Строка);
	Стр ="";
	Если Количество > 1 Тогда
		Для Инд=0 по Количество Цикл
			Стр = Стр + СтрПолучитьСтроку(Строка,Инд)+" ";    
		КонецЦикла;
		Возврат СокрЛП(Стр);
	Иначе
		Возврат Строка
	КонецЕсли;
КонецФункции

//&НаСервере
//Функция ПолучитьНомерПолучателя(Получатель)
//		Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ПолучателиТСРКонтактныеТелефоныПолучателя.НомерТелефона
//		|ИЗ
//		|	Справочник.ПолучателиТСР.КонтактныеТелефоныПолучателя КАК ПолучателиТСРКонтактныеТелефоныПолучателя
//		|ГДЕ
//		|	ПолучателиТСРКонтактныеТелефоныПолучателя.ТелефонДляОтправкиСМС
//		|	И ПолучателиТСРКонтактныеТелефоныПолучателя.Ссылка = &Ссылка";
//	
//	Запрос.УстановитьПараметр("Ссылка", Получатель);
//	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
//	
//	Если  РезультатЗапроса.Количество()> 0 Тогда
//		НомерТелефона = РезультатЗапроса[0].НомерТелефона;
//		RegExp = Новый COMОбъект("VBScript.RegExp");
//		RegExp.IgnoreCase = Истина; //Игнорировать регистр 
//		RegExp.Global = Истина; //Поиск всех вхождений шаблона 
//		RegExp.MultiLine = Истина; //Многострочный режим 
//		RegExp.Pattern = "[^0-9]"; // отбор только чисел
//		НомерТелефона = RegExp.Replace(НомерТелефона, ""); 	
//		НомерТелефона = Лев(НомерТелефона,11);
//		Если Лев(НомерТелефона,1) = "8" Тогда
//			НомерТелефона = "7"+Сред(НомерТелефона,2);
//		КонецЕсли;		
//		Возврат НомерТелефона;
//	Иначе
//		Возврат "";
//	КонецЕсли;

//КонецФункции

&НаКлиенте
Процедура ОтправительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
 СтандартнаяОбработка = Ложь;
 ДанныеВыбора = ВернутьПолучателей();

КонецПроцедуры

&НаСервере
Функция ВернутьПолучателей()
 Список = Новый СписокЗначений;
 Список.Добавить("ORTONICA.RU");
 Список.Добавить("Reamed");
 Список.Добавить("OOO M-VTK");
КонецФункции
